#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bangkit/learn-terraform-github-actions/runs/run-x7tvtf63CyU52UV5

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
google_storage_bucket.bucket_models: Refreshing state... [id=models-lyrical-ward-382514]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_gcp_project" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-x7tvtf63CyU52UV5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_gcp_credential"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-x7tvtf63CyU52UV5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.bucket_models will be destroyed
  # (because google_storage_bucket.bucket_models is not in configuration)
  - resource "google_storage_bucket" "bucket_models" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "models-lyrical-ward-382514" -> null
      - labels                      = {} -> null
      - location                    = "US-CENTRAL1" -> null
      - name                        = "models-lyrical-ward-382514" -> null
      - project                     = "lyrical-ward-382514" -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/models-lyrical-ward-382514" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://models-lyrical-ward-382514" -> null
    }

  # module.my_custom_bucket.google_storage_bucket.bucket_models will be created
  + resource "google_storage_bucket" "bucket_models" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "models-lyrical-ward-382514"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @Dimaspadma, Action: `pull_request`*